# Taps
tap "ariga/tap"
tap "defenseunicorns/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "hudochenkov/sshpass"
tap "kreuzwerker/taps"
tap "schpet/tap"
tap "stripe/stripe-cli"

# Applications installed by homebrew/cask
cask "1password"
cask "1password-cli"
cask "adobe-digital-editions"
cask "appcleaner"
cask "beekeeper-studio"
cask "calibre"
cask "discord"
cask "font-hack"
cask "google-chrome"
cask "lens"
cask "linear-linear"
cask "mactex-no-gui"
cask "monitorcontrol"
cask "notion"
cask "notion-calendar"
cask "openvpn-connect"
cask "orbstack"
cask "session-manager-plugin"
cask "slack"
cask "tailscale-app"
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "wezterm"
cask "yt-music"

# Binaries / Libraries
brew "ack"
brew "aws-iam-authenticator"
brew "awscli"
brew "azure-cli"
brew "circleci"
brew "docker", link: false
brew "eksctl"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "golangci-lint"
brew "grpc"
brew "helm"
brew "htop"
brew "influxdb-cli"
brew "jq"
brew "k6"
brew "kubectx"
brew "mactop"
brew "mas"
brew "minikube"
brew "mockery"
brew "mole"
brew "mtr"
brew "mysql"
brew "nmap"
brew "node@20"
brew "openjdk"
brew "openjdk@11"
brew "openapi-generator"
brew "postgresql@14"
brew "postgresql@16"
brew "pre-commit"
brew "protobuf"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "redis"
brew "shellcheck"
brew "tmux"
brew "tree"
brew "uv"
brew "virtualenv"
brew "wget"
brew "woof"
brew "yarn"
brew "yq"
brew "zsh"
brew "defenseunicorns/tap/zarf"
brew "hashicorp/tap/terraform"
brew "hudochenkov/sshpass/sshpass"
brew "schpet/tap/linear"
brew "stripe/stripe-cli/stripe"

# VSCode extensions
vscode "anthropic.claude-code"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "golang.go"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "james-yu.latex-workshop"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "redhat.ansible"
vscode "timonwong.shellcheck"

# Applications installed from Mac App Store https://github.com/mas-cli/mas
mas "Between", id: 1627676006
mas "Day One", id: 1055511498
mas "KakaoTalk", id: 869223134
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
