# Taps
tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"

# Binaries / Libraries
brew "ack"
brew "aws-iam-authenticator"
brew "openssl@1.1"
brew "sqlite"
brew "awscli"
brew "docker"
brew "dockutil"
brew "eksctl"
brew "exa"
brew "go"
brew "helm"
brew "htop"
brew "jq"
brew "kubectx"
brew "mas"
brew "minikube"
brew "mtr"
brew "node"
brew "openblas"
brew "poetry"
brew "pre-commit"
brew "pyenv"
brew "python@3.9"
brew "terraform"
brew "tmux"
brew "wget"
brew "zsh"

# Applications installed by homebrew/cask
cask "adobe-digital-editions"
cask "adoptopenjdk9"
cask "appcleaner"
cask "beekeeper-studio"
cask "calibre"
cask "docker"
cask "font-hack"
cask "font-source-code-pro"
cask "google-chat"
cask "google-chrome"
cask "iterm2"
cask "mactex-no-gui"
cask "notion"
cask "slack"
cask "steam"
cask "visual-studio-code"

# Applications installed from Mac App Store https://github.com/mas-cli/mas
mas "Between", id: 1320741520
mas "Day One", id: 1055511498
mas "feedly", id: 865500966
mas "KakaoTalk", id: 869223134
mas "Keynote", id: 409183694
mas "MKPlayer", id: 1335612105
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
mas "Flow", id: 1423210932
