# Taps
tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "stripe/stripe-cli"

# Applications installed by homebrew/cask
cask "1password"
cask "adobe-digital-editions"
cask "appcleaner"
cask "beekeeper-studio"
cask "calibre"
cask "cron"
cask "docker"
cask "font-hack"
cask "google-chrome"
cask "google-cloud-sdk"
cask "iterm2"
cask "lens"
cask "linear-linear"
cask "mactex-no-gui"
cask "notion"
cask "openvpn-connect"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "vlc"

# Binaries / Libraries
brew "ack"
brew "protobuf"
brew "grpc"
brew "aws-iam-authenticator"
brew "awscli"
brew "circleci"
brew "docker"
brew "dockutil"
brew "eksctl"
brew "exa"
brew "git"
brew "go"
brew "helm"
brew "htop"
brew "influxdb", restart_service: true
brew "influxdb-cli"
brew "jq"
brew "kubectx"
brew "mas"
brew "minikube"
brew "mtr"
brew "mysql", restart_service: true
brew "node@14"
brew "openapi-generator"
brew "postgresql"
brew "pre-commit"
brew "pyenv"
brew "pyenv-virtualenv"
brew "redis", restart_service: true
brew "shellcheck"
brew "terraform"
brew "tmux"
brew "tree"
brew "wget"
brew "yarn"
brew "zsh"
brew "stripe/stripe-cli/stripe"

# Applications installed from Mac App Store https://github.com/mas-cli/mas
mas "Between", id: 1320741520
mas "Day One", id: 1055511498
mas "feedly", id: 865500966
mas "KakaoTalk", id: 869223134
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
